** Ruby

#+name: expand_sequence
#+begin_src ruby
  def parse_rules(lines)
    rules = {}
    lines.each do |line|
      if /(?<pair>[A-Z]{2}) -> (?<inserted>[A-Z])/ =~ line
        rules[pair] = [pair[0], inserted, pair[1]]
      end
    end
    rules
  end

  def expand_rules(rules, original_rules)
    new_rules = {}
    rules.each do |pair, output|
      new_output = []
      output.each_with_index do |c, i|
        if i+1 == output.length
          new_output << c
          break
        end

        if pair_output = original_rules[c+output[i+1]]
          new_output += pair_output[...-1]
        else
          new_output << c
        end
      end
      new_rules[pair] = new_output
    end

    new_rules
  end

def expand_sequence(sequence, rules)
  new_sequence = []
  sequence.each_char.with_index do |c, i|
    if i+1 == sequence.length
      new_sequence << c
      break
    end
    if sub = rules[c+sequence[i+1]]
      new_sequence += sub[...-1]
    else
      new_sequence << c
    end
  end
  new_sequence.join
end
#+end_src

#+name: score
#+begin_src ruby
  def score(sequence)
    frequencies = sequence.each_char.to_a.tally
    frequencies.values.max - frequencies.values.min
  end
#+end_src

#+begin_src ruby :noweb yes :tangle part1.rb
  <<expand_sequence>>
  <<score>>

  lines = File.readlines('input')
  rules = parse_rules(lines)
  original_rules = rules.dup
  9.times do
    rules = expand_rules(rules, original_rules)
 end
 score(expand_sequence(lines[0].strip, rules))
#+end_src

#+RESULTS:
: 3906

** Ruby
#+name: expand_pairs
#+begin_src ruby
def parse_rules(lines)
  rules = {}
  lines.each do |line|
    if /(?<pair>[A-Z]{2}) -> (?<inserted>[A-Z])/ =~ line
      rules[pair] = [pair[0]+inserted, inserted+pair[1]]
    end
  end
  rules
end

def count_pairs(sequence)
  sequence.each_char.to_a.each_cons(2).reduce({}) do |counts, pair|
    counts[pair.join] ||= 0
    counts[pair.join] += 1
    counts
  end
end

def expand_pairs(pairs, rules)
  new_counts = {}
  pairs.each do |pair, count|
    rules[pair].each do |new_pair|
      new_counts[new_pair] ||= 0
      new_counts[new_pair] += count
    end
  end
  new_counts
end

def score(pairs, sequence)
  frequencies = {}
  pairs.each do |pair, count|
    frequencies[pair[0]] ||= 0
    frequencies[pair[0]] += count
  end
  frequencies[sequence[-1]] += 1
  frequencies.values.max - frequencies.values.min
end
#+end_src

#+begin_src ruby :noweb yes :tangle part2.rb
   <<expand_pairs>>

   lines = File.readlines('input')
   rules = parse_rules(lines)
   sequence = lines[0].strip
   pairs = count_pairs(sequence)
   40.times do
     pairs = expand_pairs(pairs, rules)
   end
  score(pairs, sequence)
#+end_src

#+RESULTS:
: 4441317262452

